Table of Contents
 Interface IIdeaNode
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
Represents named and identifiable node that several members can connect to.
public interface IIdeaNode : IIdeaPersistentObject, IIdeaObject
Inherited Members
 IIdeaPersistentObject.Token
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 Vector
IdeaVector3D Vector { get; }
Property Value
IdeaVector3D
 Edit this page